[{"title": "NASA-JPL Names 'Rolling Stones Rock' on Mars", "preview": "NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}, {"title": "NASA's Mars Reconnaissance Orbiter Undergoes Memory Update", "preview": "Other orbiters will continue relaying data from Mars surface missions for a two-week period."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"title": "A New Video Captures the Science of NASA's Perseverance Mars Rover", "preview": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."}, {"title": "NASA's Mars 2020 Rover Closer to Getting Its Name", "preview": "155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."}, {"title": "NASA Wins 4 Webbys, 4 People's Voice Awards", "preview": "Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive."}, {"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "NASA's Perseverance Mars Rover Gets Its Wheels and Air Brakes", "preview": "After the rover was shipped from JPL to Kennedy Space Center, the team is getting closer to finalizing the spacecraft for launch later this summer."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation", "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."}, {"title": "AI Is Helping Scientists Discover Fresh Craters on Mars", "preview": "It's the first time machine learning has been used to find previously unknown craters on the Red Planet."}, {"title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars", "preview": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}]